doc/slides/slide_heritage_1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Héritage (Partie 1)</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><aa>Encapsulation des données </aa><aa>Constructeur & Destructeur de classe </aa><aa>Amitié & Surcharge d'opérateur </aa><aa>Héritage (Partie 1) </aa><aa>Héritage (Partie 2) </aa><aa>Patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard </aa>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Héritage (Partie 1)</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>L&rsquo;héritage est un nouveau moyen de faire intéragir les classes entre elles par
le biais de <b>relations dites hiérarchiques</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Introduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Une classe <code>B</code> qui hérite d&rsquo;une classe <code>A</code> a accès à tous les membres et
méthodes de <code>A</code>
</li>
</ul>

<ul class="org-ul">
<li>Ainsi, la classe <code>B</code> est basée sur la classe <code>A</code> mais peut également ajouter
de nouveaux membres ainsi que de nouvelles méthodes propres à sa fonction :

<ul class="org-ul">
<li>[&rarr;] la classe <code>A</code> que l&rsquo;on appellera <b>classe mère ou de base</b> est
    <b>une généralisation</b> de <code>B</code>,
</li>

<li>[&rarr;] la classe <code>B</code> que l&rsquo;on dit <b>dérivée ou classe fille</b>
de <code>A</code> est donc <b>spécialisation</b> de <code>A</code>.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Notions d&rsquo;héritage simple</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">protected</span>:
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">m_nombre_segment</span>;
};

<span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">set_largeur</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">largeur_</span>);

<span class="org-keyword">private</span>:
  <span class="org-type">double</span> <span class="org-variable-name">m_longueur</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_largeur</span>;
};
</pre>
</div>

<ul class="org-ul">
<li>La relation d&rsquo;héritage est matérialisée par l&rsquo;usage de la directive <b><code>public
  polygone</code></b>
</li>
</ul>
<ul class="org-ul">
<li>Le mot-clé <b><code>protected</code></b> autorise la classe dérivée (ici <code>rectangle</code>) à accéder
aux membres de la classe de base (ici <code>polygone</code>)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Statut des membres et méthodes de classe</h2>
<div class="outline-text-2" id="text-4">
<dl class="org-dl">
<dt> <code>private</code> </dt><dd>les membres ne sont accessibles qu&rsquo;aux méthodes et aux fonctions
amies de la classe
</dd>
<dt> <code>protected</code> </dt><dd>les membres sont accessibles aux méthodes de la classe de base
ainsi qu&rsquo;aux classes dérivées. Ils demeurent toutefois
inaccessibles à l&rsquo;utilisateur de la classe contrairement au
statut <code>public</code>
</dd>
<dt> <code>private</code> </dt><dd>les membres sont accessibles non seulement aux méthodes mais
également à l&rsquo;utilisateur de la classe c&rsquo;est-à-dire à n&rsquo;importe
quel objet/instance du type de la classe
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Appels des constructeurs et destructeurs</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-function-name">polygone</span> (<span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">nbr_segment_</span>) :
    m_nombre_segment (nbr_segment_) {}
<span class="org-keyword">protected</span>:
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">m_nombre_segment</span>;
};

<span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-function-name">rectangle</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">longueur_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">largeur_</span>) :
    polygone (4),
    m_longueur (longueur_), m_largeur (largeur_) {}
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Appels des constructeurs et destructeurs</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>À la construction d&rsquo;une classe fille, le constructeur de la classe mère est
appelé <b><span class="underline">avant</span></b> toutes autres opérations
</li>

<li>Lors de la destruction d&rsquo;une classe fille, le destructeur de la classe de base
est appelé automatiquement <b><span class="underline">après</span></b> le destructeur de la classe fille
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Conception d&rsquo;un programme</h2>
<div class="outline-text-2" id="text-7">
<p>
De manière générale en POO, le développeur procède de la façon suivante:
</p>

<ol class="org-ol">
<li><b>Répertorier</b> les objets nécessaires à la description du problème,
</li>

<li><b>Réfléchir</b> aux liens logiques entre ces objets (composition, amitié,
héritage),
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Héritage vs. Composition</h2>
<div class="outline-text-2" id="text-8">
<p>
Il faut bien distinguer les deux liens logiques que sont l&rsquo;héritage et la
composition:
</p>

<dl class="org-dl">
<dt> Composition </dt><dd>relation de type <b><span class="underline">possède un</span></b>; la classe <code>polygone</code> possède
un ensemble de <code>point</code>
</dd>
<dt> Héritage </dt><dd>relation de type <b><span class="underline">est un</span></b>; la classe <code>rectangle</code> est un
              <code>polygone</code>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Conception d&rsquo;un programme</h2>
<div class="outline-text-2" id="text-9">
<p>
De manière générale en POO, le développeur procède de la façon suivante:
</p>

<ol class="org-ol">
<li><b>Répertorier</b> les objets nécessaires à la description du problème,
</li>

<li><b>Réfléchir</b> aux liens logiques entre ces objets (composition, amitié,
héritage),
</li>

<li><b>Implémenter</b> ces objets <i>i.e.</i> déclarer les méthodes puis les définir,
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Héritage vs. Interface</h2>
<div class="outline-text-2" id="text-10">
<p>
Si l&rsquo;héritage est une notion relativement puissante en POO, il faut néanmoins
éviter les relations hiérarchique inappropriées.
</p>

<p>
<b>Exemple :</b>
</p>

<p>
Un objet de type <code>oiseau</code> tout comme un objet de type <code>avion</code> ont une fonction
en commun à savoir voler.
</p>

<p>
<b>Sont ils toutefois des classes dérivés d&rsquo;une classe plus générale de type
 <code>volatile</code> ?</b>
</p>

<p>
On préfèrera utiliser l&rsquo;héritage au niveau d&rsquo;un partage de fonctionnalité <i>i.e.</i>
<b>une interface</b> déclarant une capacité à voler, chaque classe <code>oiseau</code> et
<code>avion</code> spécialisant la méthode <code>vole</code>
</p>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Conception d&rsquo;un programme</h2>
<div class="outline-text-2" id="text-11">
<p>
De manière générale en POO, le développeur procède de la façon suivante:
</p>

<ol class="org-ol">
<li><b>Répertorier</b> les objets nécessaires à la description du problème,
</li>

<li><b>Réfléchir</b> aux liens logiques entre ces objets (composition, amitié,
héritage),
</li>

<li><b>Implémenter</b> ces objets <i>i.e.</i> déclarer les méthodes puis les définir,
</li>

<li><b>Créer</b> des instances de ces objets et <b>utiliser</b> leurs méthodes pour
répondre au problème posé.
</li>
</ol>
</div>
</div>
</div>
</body>
</html>
